<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"><plist version="1.0"><dict>	<key>PayloadIdentifier</key>	<string>org.school.profile.safari.20161121</string>	<key>PayloadRemovalDisallowed</key>	<true/>	<key>PayloadScope</key>	<string>User</string>	<key>PayloadType</key>	<string>Configuration</string>	<key>PayloadUUID</key>	<string>69F2AD5C-A85E-11E6-80F5-76304DEC7EB7</string>	<key>PayloadOrganization</key>	<string>School Name</string>	<key>PayloadVersion</key>	<integer>1</integer>	<key>PayloadDisplayName</key>	<string>Safari Configuration</string>	<key>PayloadContent</key>	<array>		<dict>			<key>PayloadType</key>			<string>com.apple.ManagedClient.preferences</string>			<key>PayloadVersion</key>			<integer>1</integer>			<key>PayloadIdentifier</key>			<string>org.school.profile.safari.20161121.config</string>			<key>PayloadUUID</key>			<string>E276A24C-A85E-11E6-80F5-76304DEC7EB7</string>			<key>PayloadEnabled</key>			<true/>			<key>PayloadDisplayName</key>			<string>School Name: (com.apple.safari)</string>			<key>PayloadContent</key>			<dict>				<key>com.apple.Safari</key>				<dict>					<key>Forced</key>					<array>						<dict>							<key>mcx_preference_settings</key>							<dict>								<key>AlwaysRestoreSessionAtLaunch</key>								<false/>								<key>NewWindowBehavior</key>								<integer>0</integer>								<key>NewTabBehavior</key>								<integer>0</integer>								<key>HomePage</key>								<string>http://www.google.com</string>								<key>DidDisableIndividualExtensionsAfterRemovingOnOffSwitchIfNecessary</key>								<true/>								<key>DidMigrateDisabledPlugInsInfoToAllPlugInsInfo</key>								<true/>								<key>DidMigrateExtensionSettingsToExtensionsDomain</key>								<true/>								<key>DidMigrateNewBookmarkSheetToReadingListDefault</key>								<true/>								<key>DidMigrateStartPageDefaultSidebarVisibility</key>								<true/>								<key>DidMigrateTabsToLinksForReaderKey</key>								<true/>								<key>DidMigrateToMoreRestrictiveFileURLPolicy</key>								<true/>								<key>DidMigrateWebKit1Preferences</key>								<true/>								<key>DidReportHistorySettings</key>								<true/>								<key>DidUnsubscribeFromRSSFeeds</key>								<true/>								<key>DownloadsPath</key>								<string>~/Downloads</string>								<key>DownloadsPathWasConverted</key>								<true/>								<key>ExtensionsEnabled</key>								<true/>								<key>ShowOverlayStatusBar</key>								<true/>								<key>ShowSidebarInTopSites</key>								<false/>								<key>ShowStatusBar</key>								<true/>								<key>ShowStatusBarInFullScreen</key>								<false/>								<key>WebKitDeveloperExtrasEnabledPreferenceKey</key>								<true/>								<key>WebKitJavaScriptCanOpenWindowsAutomatically</key>								<true/>								<key>WebKitRespectStandardStyleKeyEquivalents</key>								<true/>								<key>ManagedPlugInPolicies</key>								<dict>									<key>com.macromedia.Flash Player.plugin</key>									<dict>										<key>PlugInDisallowPromptBeforeUseDialog</key>										<true/>										<key>PlugInFirstVisitPolicy</key>										<string>PlugInPolicyAsk</string>									</dict>								</dict>							</dict>						</dict>					</array>				</dict>			</dict>		</dict>	</array></dict></plist>